cf/InformationRegisters/НДФЛСтандартныеВычетыНаДетей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НДФЛСтандартныеВычетыНаДетей</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоДетей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДетейЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодВычета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/НДФЛСтандартныеВычетыНаДетей/Ext/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ЗаполнитьКоличествоДетейЗавершения(НаборЗаписей)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Данные",НаборЗаписей.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НДФЛСтандартныеВычетыНаДетей.Период,
	|	НДФЛСтандартныеВычетыНаДетей.Физлицо,
	|	НДФЛСтандартныеВычетыНаДетей.КодВычета,
	|	НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения,
	|	НДФЛСтандартныеВычетыНаДетей.КоличествоДетей,
	|	НДФЛСтандартныеВычетыНаДетей.Основание
	|ПОМЕСТИТЬ ВТНаборЗаписей
	|ИЗ
	|	&Данные КАК НДФЛСтандартныеВычетыНаДетей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследних.Период,
	|	СрезПоследних.Физлицо,
	|	СрезПоследних.КодВычета,
	|	СрезПоследних.ПериодЗавершения,
	|	СрезПоследних.КоличествоДетей,
	|	НаборЗаписейОснование.Основание,
	|	ВЫБОР
	|		КОГДА НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения <= СрезПоследних.Период
	|				И НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСтандартныеВычетыНаДетей.КоличествоДетейЗавершения
	|		ИНАЧЕ НДФЛСтандартныеВычетыНаДетей.КоличествоДетей
	|	КОНЕЦ КАК КоличествоДетейЗавершения
	|ИЗ
	|	(ВЫБРАТЬ
	|		НаборЗаписей.Период КАК Период,
	|		НаборЗаписей.Физлицо КАК Физлицо,
	|		НаборЗаписей.КодВычета КАК КодВычета,
	|		НаборЗаписей.ПериодЗавершения КАК ПериодЗавершения,
	|		НаборЗаписей.КоличествоДетей КАК КоличествоДетей,
	|		МАКСИМУМ(НДФЛСтандартныеВычетыНаДетей.Период) КАК ПериодСреза
	|	ИЗ
	|		ВТНаборЗаписей КАК НаборЗаписей
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыНаДетей КАК НДФЛСтандартныеВычетыНаДетей
	|			ПО НаборЗаписей.Физлицо = НДФЛСтандартныеВычетыНаДетей.Физлицо
	|				И НаборЗаписей.КодВычета = НДФЛСтандартныеВычетыНаДетей.КодВычета
	|				И НаборЗаписей.Период > НДФЛСтандартныеВычетыНаДетей.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НаборЗаписей.Период,
	|		НаборЗаписей.Физлицо,
	|		НаборЗаписей.КодВычета,
	|		НаборЗаписей.ПериодЗавершения,
	|		НаборЗаписей.КоличествоДетей) КАК СрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыНаДетей КАК НДФЛСтандартныеВычетыНаДетей
	|		ПО СрезПоследних.Физлицо = НДФЛСтандартныеВычетыНаДетей.Физлицо
	|			И СрезПоследних.КодВычета = НДФЛСтандартныеВычетыНаДетей.КодВычета
	|			И СрезПоследних.ПериодСреза = НДФЛСтандартныеВычетыНаДетей.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНаборЗаписей КАК НаборЗаписейОснование
	|		ПО СрезПоследних.Физлицо = НаборЗаписейОснование.Физлицо
	|			И СрезПоследних.КодВычета = НаборЗаписейОснование.КодВычета
	|			И СрезПоследних.Период = НаборЗаписейОснование.Период";
	
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;

	Если Количество() > 0 Тогда
		ЗаполнитьКоличествоДетейЗавершения(ЭтотОбъект)	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;

	Если Количество() > 0 Тогда
		
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры
